Viewport Class
 An element that establishes the placement of a view on a sheet.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public class Viewport : Element
Visual Basic
Public Class Viewport _
	Inherits Element
Visual C++
public ref class Viewport : public Element
Remarks
 Viewports are used in Revit for purposes other than placement of views on sheets. Thus iteration of viewport elements in the model may locate viewports which are not assigned to sheets; you can use the SheetId property to filter these out.
Inheritance Hierarchy
SystemObject
 Autodesk.Revit.DBElement
 Autodesk.Revit.DBViewport
See Also
Viewport Members
Autodesk.Revit.DB Namespace
 ArchiLabs
Stop fighting Revit automation.
Build repeatable BIM design and documentation workflows with scripts, data, and AI in one place, without wrestling brittle one-off automations.
 Try ArchiLabs →